[
  {
    "title": "When Trouble Comes My Way",
    "speaker": "Malik Speckman",
    "church": "Tampa Bay ICC",
    "book_reference": "John 14-16",
    "series_number": 1,
    "word_count": 5204,
    "verses": [
      "John 14:1",
      "John 14:12-14",
      "James 4:1-5",
      "1 John 3:15",
      "John 14:15",
      "John 14:21",
      "John 14:23",
      "John 3:16",
      "John 15:1-8",
      "Isaiah 54:13",
      "Matthew 28:19-20",
      "Revelation 2:5",
      "John 15:9-17",
      "John 16:20-24",
      "Revelation 21:4",
      "John 16:29-33",
      "Luke 9:23"
    ],
    "summary": "The sermon, \"When Trouble Comes My Way,\" centered on John 14-16, asserts that faith in Jesus enables believers to overcome any trouble, no matter how daunting. The primary application is to respond to difficulties through consistent prayer and obedience, which are crucial for remaining in Jesus and bearing spiritual fruit. The speaker emphasizes the necessity of praying with right motives, avoiding worldly desires, and being humble enough to take advice on practical obedience. Disciples are assured that their grief will transform into complete joy, as Jesus has already overcome the world.",
    "tags": [
      "trouble",
      "faith",
      "prayer",
      "obedience",
      "motives",
      "discipleship",
      "bearing fruit",
      "joy",
      "overcoming",
      "worldliness",
      "community",
      "pruning",
      "love"
    ],
    "verse_insights": [
      {
        "verse": "John 14:1",
        "insight": "The sermon interprets this verse as Jesus telling believers not to let their hearts be troubled, but to place their faith in Him. This faith enables them to \"weather any storm\" and overcome any hardship, regardless of its objective difficulty, by trusting in Christ."
      },
      {
        "verse": "John 14:12-14",
        "insight": "This passage is presented as Jesus' promise that believers will perform greater works and that anything asked in His name will be done. The speaker connects this to glorifying God, stating that true glorification in work stems from glorifying God in prayer."
      },
      {
        "verse": "James 4:1-5",
        "insight": "The speaker uses this passage to expose the root causes of conflict and unanswered prayers: wrong desires and worldly motives. It highlights that asking with selfish intentions, or being a \"friend of the world,\" makes one an enemy of God and prevents receiving from Him."
      },
      {
        "verse": "John 15:1-8",
        "insight": "This metaphor of the vine and branches teaches that remaining in Jesus (through prayer and obedience) is crucial for bearing fruit, which is evidence of one's walk with God. Branches that don't bear fruit are cut off, while fruitful ones are pruned to produce even more, emphasizing spiritual growth and dependence on Christ."
      },
      {
        "verse": "John 15:9-17",
        "insight": "Jesus' love is contingent on keeping His commands, leading to complete joy. The ultimate command is to love one another, laying down one's life, and bearing lasting fruit because He chose and appointed disciples."
      },
      {
        "verse": "John 16:29-33",
        "insight": "Jesus' closing words in this section provide peace amidst inevitable worldly trouble, declaring that He has overcome the world. The speaker uses this to call disciples to be \"overcomers\" through faith, denying themselves, carrying their cross daily, and conquering any fear or embarrassment that might hinder obedience."
      }
    ],
    "transcript_preview": "John chapter 14. It says in verse one, \"Do not let your hearts be troubled. You believe in God, believe also in me. You know, trouble, confusion, fear, embarrassment, when your heart is troubled, moved out of place where it needs to be, it could take you else there. Storms are Have you if you've ever seen, we're in Tampa. the the hurricanes could be massive and they could be bigger still. WHO KNOWS WHAT H WHAT WE HAVE IN STORE WITH THE THE THE the catastrophes and phenomenons of nature and they ..."
  },
  {
    "title": "Never Stay Down",
    "speaker": "Malik Speckman",
    "church": "Tampa Bay ICC",
    "book_reference": "John 11-13",
    "series_number": 2,
    "word_count": 6299,
    "verses": [
      "John 11:1-4",
      "John 11:8-11",
      "John 11:20-27",
      "Luke 8",
      "Luke 7",
      "Acts 13:36",
      "John 11:32-44",
      "John 11:45",
      "John 12:12-19",
      "John 12:23-26",
      "John 12:27",
      "John 12:37-43",
      "John 12:47-48",
      "Matthew 4:4",
      "John 16:33",
      "Isaiah 53:1",
      "Isaiah 6:9-10",
      "John 13:1",
      "John 13:2-5",
      "John 13:12-15",
      "John 13:26",
      "John 13:31-35",
      "Romans 13:7-11"
    ],
    "summary": "The sermon \"Never Stay Down\" encourages believers to overcome spiritual sickness and live out God's purpose, emphasizing that \"it's never too late\" for recovery and repentance. Drawing from Lazarus's resurrection, the speaker highlights the importance of dying to one's old self and resisting excuses during hardship, as the world will respond to the truth of Christ. The message culminates in a call for disciples to \"love until the end,\" serving others unconditionally as Jesus exemplified, knowing this love fulfills God's law and marks them as His followers.",
    "tags": [
      "spiritual health",
      "healing",
      "recovery",
      "purpose",
      "repentance",
      "faith",
      "resurrection",
      "dying to self",
      "overcoming hardship",
      "servanthood",
      "love",
      "discipleship",
      "salvation",
      "witnessing",
      "glorifying God",
      "spiritual warfare",
      "obedience",
      "prayer"
    ],
    "verse_insights": [
      {
        "verse": "John 11:1-4",
        "insight": "This passage, detailing Lazarus's sickness, is presented to show that even in dire situations, suffering can be for God's glory. The speaker uses it to introduce the theme that spiritual sickness, which might seem to lead to 'spiritual death,' can be overcome, leading to God's glorification when healing occurs."
      },
      {
        "verse": "Acts 13:36",
        "insight": "Referencing David, this verse emphasizes that no one can outlive or die sooner than God's intended purpose for them. It serves as an encouragement that if one is alive, God still has a plan, reinforcing the sermon's core message that 'it is never too late' to wake up from spiritual slumber and pursue God's will."
      },
      {
        "verse": "John 12:23-26",
        "insight": "The 'kernel of wheat' metaphor is central here, illustrating that spiritual growth requires a 'death' to the old self to produce new life and spiritual fruit. The speaker urges listeners to abandon old ways of thinking and coping, and to completely die to their former life, leaving it in the tomb to fully embrace transformation."
      },
      {
        "verse": "John 13:12-15",
        "insight": "Jesus washing the disciples' feet is highlighted as a powerful example of humble servitude and unconditional love. The sermon challenges believers to embody this selfless service within their spiritual community, encouraging them to continually serve their brothers and sisters regardless of how they are treated in return."
      },
      {
        "verse": "Romans 13:7-11",
        "insight": "This passage defines the singular, outstanding 'debt' owed by disciples: to love one another, which fulfills the entire law. The speaker uses it to impress upon the audience that love is the foundational expectation among believers, urging them to 'wake up from slumber' and live out this command, recognizing that their salvation is ever nearer."
      }
    ],
    "transcript_preview": "And I was thinking about sickness and it made me start to think of not just physical sickness but spiritual sickness &gt;&gt; and what happens when you don't get well. &gt;&gt; What happens when your your spiritual health isn't good? And so as we talk about today's lesson, I want you guys to reflect on your own spiritual health. &gt;&gt; Let's go to John chapter 11. &gt;&gt; Starting in verse one, it says, \"Now a man named Lazarus was sick. He was from Bethany, the village of Mary and her sister..."
  },
  {
    "title": "Filter Your Life",
    "speaker": "Malik Speckman",
    "church": "Tampa Bay ICC",
    "book_reference": "John 8-10",
    "series_number": 3,
    "word_count": 6885,
    "verses": [
      "John 8:10-11",
      "John 8:12",
      "Ephesians 4:17-24",
      "John 8:25-29",
      "John 8:30-32",
      "John 8:34",
      "John 8:42-47",
      "John 9:1-5",
      "Proverbs 16:18",
      "John 9:35-41",
      "Matthew 21:42-44",
      "John 10:1-5",
      "John 10:7",
      "John 10:11-13",
      "John 10:23-30"
    ],
    "summary": "This sermon, titled \"Filter Your Life,\" urges believers to actively filter every aspect of their lives—thoughts, emotions, desires, and relationships—through the Bible, which is God's perfect filter. Speaker Malik Speckman highlights that Jesus frees us from condemnation and offers the truth, which, when followed, sets us free from sin's enslavement. He emphasizes that true spirituality is determined by God's word, not worldly ideals, and that acknowledging weaknesses allows God's power to be displayed. The sermon also warns against false doctrine and the deceptive promises of Satan, encouraging disciples to live as shepherds for others, guiding them away from sin by upholding God's truth.",
    "tags": [
      "filtering life",
      "bible",
      "truth",
      "sin",
      "condemnation",
      "freedom",
      "light",
      "spirituality",
      "weakness",
      "humility",
      "pride",
      "false doctrine",
      "good shepherd",
      "discipleship",
      "obedience"
    ],
    "verse_insights": [
      {
        "verse": "John 8:10-11",
        "insight": "The speaker explains that Jesus frees us from man's condemnation and embarrassment when caught in sin. However, this freedom is not a license to continue sinning, but an invitation to choose to 'go and leave your life of sin,' highlighting personal responsibility in living a life free from previous sinful habits."
      },
      {
        "verse": "John 8:12",
        "insight": "This verse presents Jesus as 'the light of the world,' promising that those who follow Him will 'never walk in darkness, but will have the light of life.' The sermon emphasizes that choosing to walk in this light means actively choosing not to live in sin and embracing truth, thereby dispelling darkness from one's life."
      },
      {
        "verse": "Ephesians 4:17-24",
        "insight": "This passage calls Christians to live differently from Gentiles, whose thinking is futile and understanding darkened. The speaker uses it to teach that being a Christian starts at the thought level, requiring believers to 'put off your old self' corrupted by deceitful desires and 'put on the new self' created in true righteousness and holiness, demonstrating a transformed inward being that impacts outward actions."
      },
      {
        "verse": "John 8:30-32",
        "insight": "Jesus declares that if those who believe in Him 'hold to my teaching, you are really my disciples. Then you will know the truth, and the truth will set you free.' The sermon clarifies that mere belief is insufficient; true freedom from the enslavement of sin comes through persistent obedience to Jesus's teachings, which are equated with God's Word."
      },
      {
        "verse": "John 10:1-5, 7, 11-13",
        "insight": "Jesus identifies Himself as both the gate and the good shepherd, contrasting Himself with thieves, robbers, and hired hands. The sermon explains that the good shepherd lays down his life for the sheep and guides them away from the 'wolf' (Satan/sin), while false leaders abandon the flock. This highlights the importance of discerning true spiritual guidance and making God's Word the filter for all teachings to avoid deception."
      }
    ],
    "transcript_preview": "It says in John chapter 8, we're going to start towards the end of this uh example here. And if most of your Bibles likely have this, but it says uh the earliest manuscripts don't actually have this part of John. And that's interesting because if you like anybody start to question, you want to question so you can understand and understand so you can believe maybe start to question well if it wasn't in the earliest manuscripts the earliest text then why is it in here now? &gt;&gt; And then maybe ..."
  }
]